
//============================================================================================================================================
// Trabajo Práctico 2 // Diseño e Implementación de Estructuras
//============================================================================================================================================

package aed;

interface Handle<T> {
  /*La interfaz Handle<T> declara los siguientes métodos:*/
  
  public T valor();               // Devuelve el valor del elemento.
  public void eliminar();         // Elimina al elemento de la colección.
  public void modificar(T valor); // Modifica el valor del handle de tipo T.
}

//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
//————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————